RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_qeo_regs.h
/*
 * AMP_VAL (RW)
 *
 * amplitude scaling value. bit15-12 are integer part value. bit11-0 are fraction value.
 */
#define QEO_WAVE_AMPLITUDE_AMP_VAL_MASK (0xFFFFU)
#define QEO_WAVE_AMPLITUDE_AMP_VAL_SHIFT (0U)
#define QEO_WAVE_AMPLITUDE_AMP_VAL_SET(x) (((uint32_t)(x) << QEO_WAVE_AMPLITUDE_AMP_VAL_SHIFT) & QEO_WAVE_AMPLITUDE_AMP_VAL_MASK)
#define QEO_WAVE_AMPLITUDE_AMP_VAL_GET(x) (((uint32_t)(x) & QEO_WAVE_AMPLITUDE_AMP_VAL_MASK) >> QEO_WAVE_AMPLITUDE_AMP_VAL_SHIFT)

/* Bitfield definition for register of struct WAVE: WAVE0 */
/*
 * VAL (RW)
 *
 * wave0 output middle point, use this value as 32 bit signed value. bit 31 is signed bit. bit30-27 is integer part value. bit26-0 is fraction value.
 */
#define QEO_WAVE_MID_POINT_VAL_MASK (0xFFFFFFFFUL)
#define QEO_WAVE_MID_POINT_VAL_SHIFT (0U)
#define QEO_WAVE_MID_POINT_VAL_SET(x) (((uint32_t)(x) << QEO_WAVE_MID_POINT_VAL_SHIFT) & QEO_WAVE_MID_POINT_VAL_MASK)
#define QEO_WAVE_MID_POINT_VAL_GET(x) (((uint32_t)(x) & QEO_WAVE_MID_POINT_VAL_MASK) >> QEO_WAVE_MID_POINT_VAL_SHIFT)

/* Bitfield definition for register of struct WAVE: MIN */
/*
 * LIMIT1 (RW)
 *
 * low area limit level1
 */
#define QEO_WAVE_LIMIT_MIN_LIMIT1_MASK (0xFFFF0000UL)
#define QEO_WAVE_LIMIT_MIN_LIMIT1_SHIFT (16U)
#define QEO_WAVE_LIMIT_MIN_LIMIT1_SET(x) (((uint32_t)(x) << QEO_WAVE_LIMIT_MIN_LIMIT1_SHIFT) & QEO_WAVE_LIMIT_MIN_LIMIT1_MASK)
#define QEO_WAVE_LIMIT_MIN_LIMIT1_GET(x) (((uint32_t)(x) & QEO_WAVE_LIMIT_MIN_LIMIT1_MASK) >> QEO_WAVE_LIMIT_MIN_LIMIT1_SHIFT)

/*
 * LIMIT0 (RW)
 *
 * low area limit level0
 */
#define QEO_WAVE_LIMIT_MIN_LIMIT0_MASK (0xFFFFU)
#define QEO_WAVE_LIMIT_MIN_LIMIT0_SHIFT (0U)
#define QEO_WAVE_LIMIT_MIN_LIMIT0_SET(x) (((uint32_t)(x) << QEO_WAVE_LIMIT_MIN_LIMIT0_SHIFT) & QEO_WAVE_LIMIT_MIN_LIMIT0_MASK)
#define QEO_WAVE_LIMIT_MIN_LIMIT0_GET(x) (((uint32_t)(x) & QEO_WAVE_LIMIT_MIN_LIMIT0_MASK) >> QEO_WAVE_LIMIT_MIN_LIMIT0_SHIFT)

/* Bitfield definition for register of struct WAVE: MAX */
/*
 * LIMIT1 (RW)
 *
 * high area limit level1
 */
#define QEO_WAVE_LIMIT_MAX_LIMIT1_MASK (0xFFFF0000UL)
#define QEO_WAVE_LIMIT_MAX_LIMIT1_SHIFT (16U)
#define QEO_WAVE_LIMIT_MAX_LIMIT1_SET(x) (((uint32_t)(x) << QEO_WAVE_LIMIT_MAX_LIMIT1_SHIFT) & QEO_WAVE_LIMIT_MAX_LIMIT1_MASK)
#define QEO_WAVE_LIMIT_MAX_LIMIT1_GET(x) (((uint32_t)(x) & QEO_WAVE_LIMIT_MAX_LIMIT1_MASK) >> QEO_WAVE_LIMIT_MAX_LIMIT1_SHIFT)

/*
 * LIMIT0 (RW)
 *
 * high area limit level0
 */
#define QEO_WAVE_LIMIT_MAX_LIMIT0_MASK (0xFFFFU)
#define QEO_WAVE_LIMIT_MAX_LIMIT0_SHIFT (0U)
#define QEO_WAVE_LIMIT_MAX_LIMIT0_SET(x) (((uint32_t)(x) << QEO_WAVE_LIMIT_MAX_LIMIT0_SHIFT) & QEO_WAVE_LIMIT_MAX_LIMIT0_MASK)
#define QEO_WAVE_LIMIT_MAX_LIMIT0_GET(x) (((uint32_t)(x) & QEO_WAVE_LIMIT_MAX_LIMIT0_MASK) >> QEO_WAVE_LIMIT_MAX_LIMIT0_SHIFT)

/* Bitfield definition for register of struct WAVE: WAVE0 */
/*
 * VAL (RW)
 *
 * wave0 deadzone shifter value
 */
#define QEO_WAVE_DEADZONE_SHIFT_VAL_MASK (0xFFFFU)
#define QEO_WAVE_DEADZONE_SHIFT_VAL_SHIFT (0U)
#define QEO_WAVE_DEADZONE_SHIFT_VAL_SET(x) (((uint32_t)(x) << QEO_WAVE_DEADZONE_SHIFT_VAL_SHIFT) & QEO_WAVE_DEADZONE_SHIFT_VAL_MASK)
#define QEO_WAVE_DEADZONE_SHIFT_VAL_GET(x) (((uint32_t)(x) & QEO_WAVE_DEADZONE_SHIFT_VAL_MASK) >> QEO_WAVE_DEADZONE_SHIFT_VAL_SHIFT)

/* Bitfield definition for register of struct ABZ: MODE */
/*
 * REVERSE_EDGE_TYPE (RW)
 *
 * pulse reverse wave，reverse edge point:
 * 0: between pulse's posedge and negedge, min period dedicated by the num line_width
 * 1: edge change point flow pulse's negedge.
 */
#define QEO_ABZ_MODE_REVERSE_EDGE_TYPE_MASK (0x10000000UL)
#define QEO_ABZ_MODE_REVERSE_EDGE_TYPE_SHIFT (28U)
#define QEO_ABZ_MODE_REVERSE_EDGE_TYPE_SET(x) (((uint32_t)(x) << QEO_ABZ_MODE_REVERSE_EDGE_TYPE_SHIFT) & QEO_ABZ_MODE_REVERSE_EDGE_TYPE_MASK)
#define QEO_ABZ_MODE_REVERSE_EDGE_TYPE_GET(x) (((uint32_t)(x) & QEO_ABZ_MODE_REVERSE_EDGE_TYPE_MASK) >> QEO_ABZ_MODE_REVERSE_EDGE_TYPE_SHIFT)

/*
 * EN_WDOG (RW)
 *
 * enable abz wdog:
 * 0: disable abz wdog.
 * 1: enable abz wdog.
 */
#define QEO_ABZ_MODE_EN_WDOG_MASK (0x1000000UL)
#define QEO_ABZ_MODE_EN_WDOG_SHIFT (24U)
#define QEO_ABZ_MODE_EN_WDOG_SET(x) (((uint32_t)(x) << QEO_ABZ_MODE_EN_WDOG_SHIFT) & QEO_ABZ_MODE_EN_WDOG_MASK)
#define QEO_ABZ_MODE_EN_WDOG_GET(x) (((uint32_t)(x) & QEO_ABZ_MODE_EN_WDOG_MASK) >> QEO_ABZ_MODE_EN_WDOG_SHIFT)

/*
 * Z_POLARITY (RW)
 *
 * wave_z polarity.
 * 0: normal output.
 * 1: invert normal output
 */
#define QEO_ABZ_MODE_Z_POLARITY_MASK (0x100000UL)
#define QEO_ABZ_MODE_Z_POLARITY_SHIFT (20U)
#define QEO_ABZ_MODE_Z_POLARITY_SET(x) (((uint32_t)(x) << QEO_ABZ_MODE_Z_POLARITY_SHIFT) & QEO_ABZ_MODE_Z_POLARITY_MASK)
#define QEO_ABZ_MODE_Z_POLARITY_GET(x) (((uint32_t)(x) & QEO_ABZ_MODE_Z_POLARITY_MASK) >> QEO_ABZ_MODE_Z_POLARITY_SHIFT)

/*
 * B_POLARITY (RW)
 *
 * wave_b polarity.
 * 0: normal output.
 * 1: invert normal output
 */
#define QEO_ABZ_MODE_B_POLARITY_MASK (0x10000UL)
#define QEO_ABZ_MODE_B_POLARITY_SHIFT (16U)
#define QEO_ABZ_MODE_B_POLARITY_SET(x) (((uint32_t)(x) << QEO_ABZ_MODE_B_POLARITY_SHIFT) & QEO_ABZ_MODE_B_POLARITY_MASK)
#define QEO_ABZ_MODE_B_POLARITY_GET(x) (((uint32_t)(x) & QEO_ABZ_MODE_B_POLARITY_MASK) >> QEO_ABZ_MODE_B_POLARITY_SHIFT)

/*
 * A_POLARITY (RW)
 *
 * wave_a polarity.
 * 0: normal output.
 * 1: invert normal output
 */
#define QEO_ABZ_MODE_A_POLARITY_MASK (0x1000U)
#define QEO_ABZ_MODE_A_POLARITY_SHIFT (12U)
#define QEO_ABZ_MODE_A_POLARITY_SET(x) (((uint32_t)(x) << QEO_ABZ_MODE_A_POLARITY_SHIFT) & QEO_ABZ_MODE_A_POLARITY_MASK)
#define QEO_ABZ_MODE_A_POLARITY_GET(x) (((uint32_t)(x) & QEO_ABZ_MODE_A_POLARITY_MASK) >> QEO_ABZ_MODE_A_POLARITY_SHIFT)

/*
 * Z_TYPE (RW)
 *
 * wave_z type:
 * 0: zero pulse and output high at both wave_a and wave_b are high. mantain about 25% period.
 * 1: zero pulse output high about 75% period. start from 0 to 75% period.
 * 2: zero pulse output high about 100% period.
 * 3: wave_z output as tree-phase wave same as wave_a/wave_b
 */
#define QEO_ABZ_MODE_Z_TYPE_MASK (0x300U)
#define QEO_ABZ_MODE_Z_TYPE_SHIFT (8U)
#define QEO_ABZ_MODE_Z_TYPE_SET(x) (((uint32_t)(x) << QEO_ABZ_MODE_Z_TYPE_SHIFT) & QEO_ABZ_MODE_Z_TYPE_MASK)
#define QEO_ABZ_MODE_Z_TYPE_GET(x) (((uint32_t)(x) & QEO_ABZ_MODE_Z_TYPE_MASK) >> QEO_ABZ_MODE_Z_TYPE_SHIFT)

