RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_qeo_regs.h
/*
 * PWM0 (RW)
 *
 * pwm phase table value
 */
#define QEO_PWM_PHASE_TABLE_PWM0_MASK (0x3U)
#define QEO_PWM_PHASE_TABLE_PWM0_SHIFT (0U)
#define QEO_PWM_PHASE_TABLE_PWM0_SET(x) (((uint32_t)(x) << QEO_PWM_PHASE_TABLE_PWM0_SHIFT) & QEO_PWM_PHASE_TABLE_PWM0_MASK)
#define QEO_PWM_PHASE_TABLE_PWM0_GET(x) (((uint32_t)(x) & QEO_PWM_PHASE_TABLE_PWM0_MASK) >> QEO_PWM_PHASE_TABLE_PWM0_SHIFT)

/* Bitfield definition for register: POSTION_SOFTWARE */
/*
 * POSTION_SOFTWAVE (RW)
 *
 * softwave inject postion
 */
#define QEO_POSTION_SOFTWARE_POSTION_SOFTWAVE_MASK (0xFFFFFFFFUL)
#define QEO_POSTION_SOFTWARE_POSTION_SOFTWAVE_SHIFT (0U)
#define QEO_POSTION_SOFTWARE_POSTION_SOFTWAVE_SET(x) (((uint32_t)(x) << QEO_POSTION_SOFTWARE_POSTION_SOFTWAVE_SHIFT) & QEO_POSTION_SOFTWARE_POSTION_SOFTWAVE_MASK)
#define QEO_POSTION_SOFTWARE_POSTION_SOFTWAVE_GET(x) (((uint32_t)(x) & QEO_POSTION_SOFTWARE_POSTION_SOFTWAVE_MASK) >> QEO_POSTION_SOFTWARE_POSTION_SOFTWAVE_SHIFT)

/* Bitfield definition for register: POSTION_SEL */
/*
 * POSTION_SEL (RW)
 *
 * enable softwave inject postion.
 * 0: disable.
 * 1: enable.
 */
#define QEO_POSTION_SEL_POSTION_SEL_MASK (0x1U)
#define QEO_POSTION_SEL_POSTION_SEL_SHIFT (0U)
#define QEO_POSTION_SEL_POSTION_SEL_SET(x) (((uint32_t)(x) << QEO_POSTION_SEL_POSTION_SEL_SHIFT) & QEO_POSTION_SEL_POSTION_SEL_MASK)
#define QEO_POSTION_SEL_POSTION_SEL_GET(x) (((uint32_t)(x) & QEO_POSTION_SEL_POSTION_SEL_MASK) >> QEO_POSTION_SEL_POSTION_SEL_SHIFT)

/* Bitfield definition for register: STATUS */
/*
 * PWM_FOURCE (RO)
 *
 * qeo_pwm_force observe
 */
#define QEO_STATUS_PWM_FOURCE_MASK (0xFFFF0000UL)
#define QEO_STATUS_PWM_FOURCE_SHIFT (16U)
#define QEO_STATUS_PWM_FOURCE_GET(x) (((uint32_t)(x) & QEO_STATUS_PWM_FOURCE_MASK) >> QEO_STATUS_PWM_FOURCE_SHIFT)

/*
 * PWM_SAFETY (RO)
 *
 * pwm_fault status
 */
#define QEO_STATUS_PWM_SAFETY_MASK (0x1U)
#define QEO_STATUS_PWM_SAFETY_SHIFT (0U)
#define QEO_STATUS_PWM_SAFETY_GET(x) (((uint32_t)(x) & QEO_STATUS_PWM_SAFETY_MASK) >> QEO_STATUS_PWM_SAFETY_SHIFT)

/* Bitfield definition for register: DEBUG0 */
/*
 * WAVE1 (RO)
 *
 * wave1 observe
 */
#define QEO_DEBUG0_WAVE1_MASK (0xFFFF0000UL)
#define QEO_DEBUG0_WAVE1_SHIFT (16U)
#define QEO_DEBUG0_WAVE1_GET(x) (((uint32_t)(x) & QEO_DEBUG0_WAVE1_MASK) >> QEO_DEBUG0_WAVE1_SHIFT)

/*
 * WAVE0 (RO)
 *
 * wave0 observe
 */
#define QEO_DEBUG0_WAVE0_MASK (0xFFFFU)
#define QEO_DEBUG0_WAVE0_SHIFT (0U)
#define QEO_DEBUG0_WAVE0_GET(x) (((uint32_t)(x) & QEO_DEBUG0_WAVE0_MASK) >> QEO_DEBUG0_WAVE0_SHIFT)

/* Bitfield definition for register: DEBUG1 */
/*
 * QEO_FINISH (RO)
 *
 * qeo finish observe
 */
#define QEO_DEBUG1_QEO_FINISH_MASK (0x10000000UL)
#define QEO_DEBUG1_QEO_FINISH_SHIFT (28U)
#define QEO_DEBUG1_QEO_FINISH_GET(x) (((uint32_t)(x) & QEO_DEBUG1_QEO_FINISH_MASK) >> QEO_DEBUG1_QEO_FINISH_SHIFT)

/*
 * WAVE_Z (RO)
 *
 * wave_z observe
 */
#define QEO_DEBUG1_WAVE_Z_MASK (0x1000000UL)
#define QEO_DEBUG1_WAVE_Z_SHIFT (24U)
#define QEO_DEBUG1_WAVE_Z_GET(x) (((uint32_t)(x) & QEO_DEBUG1_WAVE_Z_MASK) >> QEO_DEBUG1_WAVE_Z_SHIFT)

/*
 * WAVE_B (RO)
 *
 * wave_b observe
 */
#define QEO_DEBUG1_WAVE_B_MASK (0x100000UL)
#define QEO_DEBUG1_WAVE_B_SHIFT (20U)
#define QEO_DEBUG1_WAVE_B_GET(x) (((uint32_t)(x) & QEO_DEBUG1_WAVE_B_MASK) >> QEO_DEBUG1_WAVE_B_SHIFT)

/*
 * WAVE_A (RO)
 *
 * wave_a observe
 */
#define QEO_DEBUG1_WAVE_A_MASK (0x10000UL)
#define QEO_DEBUG1_WAVE_A_SHIFT (16U)
#define QEO_DEBUG1_WAVE_A_GET(x) (((uint32_t)(x) & QEO_DEBUG1_WAVE_A_MASK) >> QEO_DEBUG1_WAVE_A_SHIFT)

/*
 * WAVE2 (RO)
 *
 * wave2 observe
 */
#define QEO_DEBUG1_WAVE2_MASK (0xFFFFU)
#define QEO_DEBUG1_WAVE2_SHIFT (0U)
#define QEO_DEBUG1_WAVE2_GET(x) (((uint32_t)(x) & QEO_DEBUG1_WAVE2_MASK) >> QEO_DEBUG1_WAVE2_SHIFT)

/* Bitfield definition for register: DEBUG2 */
/*
 * ABZ_OWN_POSTION (RO)
 *
 * abz_own_postion observe
 */
#define QEO_DEBUG2_ABZ_OWN_POSTION_MASK (0xFFFFFFFFUL)
#define QEO_DEBUG2_ABZ_OWN_POSTION_SHIFT (0U)
#define QEO_DEBUG2_ABZ_OWN_POSTION_GET(x) (((uint32_t)(x) & QEO_DEBUG2_ABZ_OWN_POSTION_MASK) >> QEO_DEBUG2_ABZ_OWN_POSTION_SHIFT)

/* Bitfield definition for register: DEBUG3 */
/*
 * ABZ_OWN_POSTION (RO)
 *
 * abz_own_postion observe
 */
#define QEO_DEBUG3_ABZ_OWN_POSTION_MASK (0xFFFFFFFFUL)
#define QEO_DEBUG3_ABZ_OWN_POSTION_SHIFT (0U)
#define QEO_DEBUG3_ABZ_OWN_POSTION_GET(x) (((uint32_t)(x) & QEO_DEBUG3_ABZ_OWN_POSTION_MASK) >> QEO_DEBUG3_ABZ_OWN_POSTION_SHIFT)



/* PHASE_SHIFT register group index macro definition */
#define QEO_WAVE_PHASE_SHIFT_WAVE0 (0UL)
#define QEO_WAVE_PHASE_SHIFT_WAVE1 (1UL)
#define QEO_WAVE_PHASE_SHIFT_WAVE2 (2UL)

/* VD_VQ_INJECT register group index macro definition */
#define QEO_WAVE_VD_VQ_INJECT_WAVE0 (0UL)
#define QEO_WAVE_VD_VQ_INJECT_WAVE1 (1UL)
#define QEO_WAVE_VD_VQ_INJECT_WAVE2 (2UL)

/* AMPLITUDE register group index macro definition */
#define QEO_WAVE_AMPLITUDE_WAVE0 (0UL)
#define QEO_WAVE_AMPLITUDE_WAVE1 (1UL)
#define QEO_WAVE_AMPLITUDE_WAVE2 (2UL)

/* MID_POINT register group index macro definition */
#define QEO_WAVE_MID_POINT_WAVE0 (0UL)
#define QEO_WAVE_MID_POINT_WAVE1 (1UL)
#define QEO_WAVE_MID_POINT_WAVE2 (2UL)

/* LIMIT register group index macro definition */
#define QEO_LIMIT_WAVE0 (0UL)
#define QEO_LIMIT_WAVE1 (1UL)
#define QEO_LIMIT_WAVE2 (2UL)

/* DEADZONE_SHIFT register group index macro definition */
#define QEO_WAVE_DEADZONE_SHIFT_WAVE0 (0UL)
#define QEO_WAVE_DEADZONE_SHIFT_WAVE1 (1UL)
#define QEO_WAVE_DEADZONE_SHIFT_WAVE2 (2UL)

/* PHASE_SHIFT register group index macro definition */
#define QEO_ABZ_PHASE_SHIFT_A (0UL)
#define QEO_ABZ_PHASE_SHIFT_B (1UL)
#define QEO_ABZ_PHASE_SHIFT_Z (2UL)

/* PHASE_SHIFT register group index macro definition */
#define QEO_PWM_PHASE_SHIFT_A (0UL)
#define QEO_PWM_PHASE_SHIFT_B (1UL)
#define QEO_PWM_PHASE_SHIFT_C (2UL)
#define QEO_PWM_PHASE_SHIFT_D (3UL)

/* PHASE_TABLE register group index macro definition */
#define QEO_PWM_PHASE_TABLE_POSEDGE0 (0UL)
#define QEO_PWM_PHASE_TABLE_POSEDGE1 (1UL)
#define QEO_PWM_PHASE_TABLE_POSEDGE2 (2UL)
#define QEO_PWM_PHASE_TABLE_POSEDGE3 (3UL)
#define QEO_PWM_PHASE_TABLE_POSEDGE4 (4UL)
#define QEO_PWM_PHASE_TABLE_POSEDGE5 (5UL)
#define QEO_PWM_PHASE_TABLE_POSEDGE6 (6UL)
#define QEO_PWM_PHASE_TABLE_POSEDGE7 (7UL)
#define QEO_PWM_PHASE_TABLE_POSEDGE8 (8UL)
#define QEO_PWM_PHASE_TABLE_POSEDGE9 (9UL)
#define QEO_PWM_PHASE_TABLE_POSEDGE10 (10UL)
#define QEO_PWM_PHASE_TABLE_POSEDGE11 (11UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE0 (12UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE1 (13UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE2 (14UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE3 (15UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE4 (16UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE5 (17UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE6 (18UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE7 (19UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE8 (20UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE9 (21UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE10 (22UL)
#define QEO_PWM_PHASE_TABLE_NEGEDGE11 (23UL)


#endif /* HPM_QEO_H */
